replica/example/benchmark_20240823_050100.log
redis-benchmark -h 127.0.0.1 -p 6379 -t get,set -c 5000 -n 500000 --threads 2 -d 200 -r 150000 -k 1 -P 3 --enable-tracking
====== SET ======
  500001 requests completed in 2.35 seconds
  5000 parallel clients
  200 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: yes
  threads: 2

Latency by percentile distribution:
0.000% <= 10.095 milliseconds (cumulative count 6)
50.000% <= 49.151 milliseconds (cumulative count 250068)
75.000% <= 65.599 milliseconds (cumulative count 375393)
87.500% <= 80.767 milliseconds (cumulative count 437511)
93.750% <= 103.871 milliseconds (cumulative count 468755)
96.875% <= 121.471 milliseconds (cumulative count 484382)
98.438% <= 140.415 milliseconds (cumulative count 492206)
99.219% <= 149.887 milliseconds (cumulative count 496118)
99.609% <= 158.207 milliseconds (cumulative count 498068)
99.805% <= 163.327 milliseconds (cumulative count 499028)
99.902% <= 184.831 milliseconds (cumulative count 499517)
99.951% <= 187.647 milliseconds (cumulative count 499775)
99.976% <= 189.695 milliseconds (cumulative count 499895)
99.988% <= 189.951 milliseconds (cumulative count 499946)
99.994% <= 190.079 milliseconds (cumulative count 499976)
99.997% <= 190.207 milliseconds (cumulative count 499994)
99.999% <= 190.335 milliseconds (cumulative count 499997)
100.000% <= 190.463 milliseconds (cumulative count 500000)
100.000% <= 190.463 milliseconds (cumulative count 500000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 10.103 milliseconds (cumulative count 9)
0.099% <= 11.103 milliseconds (cumulative count 495)
0.126% <= 12.103 milliseconds (cumulative count 630)
0.127% <= 13.103 milliseconds (cumulative count 633)
0.164% <= 15.103 milliseconds (cumulative count 822)
0.425% <= 16.103 milliseconds (cumulative count 2124)
0.878% <= 17.103 milliseconds (cumulative count 4392)
1.381% <= 18.111 milliseconds (cumulative count 6906)
1.901% <= 19.103 milliseconds (cumulative count 9504)
2.636% <= 20.111 milliseconds (cumulative count 13182)
3.424% <= 21.103 milliseconds (cumulative count 17121)
4.240% <= 22.111 milliseconds (cumulative count 21201)
5.358% <= 23.103 milliseconds (cumulative count 26790)
6.691% <= 24.111 milliseconds (cumulative count 33456)
8.540% <= 25.103 milliseconds (cumulative count 42699)
10.331% <= 26.111 milliseconds (cumulative count 51654)
11.720% <= 27.103 milliseconds (cumulative count 58599)
13.278% <= 28.111 milliseconds (cumulative count 66390)
14.814% <= 29.103 milliseconds (cumulative count 74070)
16.273% <= 30.111 milliseconds (cumulative count 81363)
18.001% <= 31.103 milliseconds (cumulative count 90006)
19.388% <= 32.111 milliseconds (cumulative count 96939)
21.250% <= 33.119 milliseconds (cumulative count 106251)
23.002% <= 34.111 milliseconds (cumulative count 115008)
24.637% <= 35.103 milliseconds (cumulative count 123183)
26.333% <= 36.127 milliseconds (cumulative count 131667)
28.199% <= 37.119 milliseconds (cumulative count 140997)
30.470% <= 38.111 milliseconds (cumulative count 152349)
32.762% <= 39.103 milliseconds (cumulative count 163812)
34.645% <= 40.127 milliseconds (cumulative count 173223)
36.137% <= 41.119 milliseconds (cumulative count 180687)
38.264% <= 42.111 milliseconds (cumulative count 191322)
40.735% <= 43.103 milliseconds (cumulative count 203676)
42.543% <= 44.127 milliseconds (cumulative count 212715)
44.203% <= 45.119 milliseconds (cumulative count 221016)
45.818% <= 46.111 milliseconds (cumulative count 229092)
47.316% <= 47.103 milliseconds (cumulative count 236580)
48.527% <= 48.127 milliseconds (cumulative count 242637)
49.976% <= 49.119 milliseconds (cumulative count 249879)
51.693% <= 50.111 milliseconds (cumulative count 258465)
53.811% <= 51.103 milliseconds (cumulative count 269055)
55.351% <= 52.127 milliseconds (cumulative count 276756)
56.766% <= 53.119 milliseconds (cumulative count 283830)
57.964% <= 54.111 milliseconds (cumulative count 289821)
59.832% <= 55.103 milliseconds (cumulative count 299160)
61.412% <= 56.127 milliseconds (cumulative count 307062)
63.305% <= 57.119 milliseconds (cumulative count 316524)
64.930% <= 58.111 milliseconds (cumulative count 324651)
66.091% <= 59.103 milliseconds (cumulative count 330456)
67.301% <= 60.127 milliseconds (cumulative count 336507)
68.440% <= 61.119 milliseconds (cumulative count 342198)
69.890% <= 62.111 milliseconds (cumulative count 349449)
71.300% <= 63.103 milliseconds (cumulative count 356499)
72.686% <= 64.127 milliseconds (cumulative count 363432)
73.964% <= 65.119 milliseconds (cumulative count 369822)
75.980% <= 66.111 milliseconds (cumulative count 379899)
77.172% <= 67.135 milliseconds (cumulative count 385860)
78.199% <= 68.159 milliseconds (cumulative count 390993)
79.230% <= 69.119 milliseconds (cumulative count 396150)
80.048% <= 70.143 milliseconds (cumulative count 400242)
80.756% <= 71.103 milliseconds (cumulative count 403782)
81.846% <= 72.127 milliseconds (cumulative count 409230)
82.838% <= 73.151 milliseconds (cumulative count 414192)
83.425% <= 74.111 milliseconds (cumulative count 417123)
83.991% <= 75.135 milliseconds (cumulative count 419955)
84.517% <= 76.159 milliseconds (cumulative count 422583)
85.277% <= 77.119 milliseconds (cumulative count 426387)
85.922% <= 78.143 milliseconds (cumulative count 429612)
86.380% <= 79.103 milliseconds (cumulative count 431898)
87.187% <= 80.127 milliseconds (cumulative count 435936)
87.629% <= 81.151 milliseconds (cumulative count 438144)
87.972% <= 82.111 milliseconds (cumulative count 439860)
88.251% <= 83.135 milliseconds (cumulative count 441255)
88.658% <= 84.159 milliseconds (cumulative count 443289)
88.998% <= 85.119 milliseconds (cumulative count 444989)
89.337% <= 86.143 milliseconds (cumulative count 446684)
89.585% <= 87.103 milliseconds (cumulative count 447923)
90.015% <= 88.127 milliseconds (cumulative count 450074)
90.393% <= 89.151 milliseconds (cumulative count 451964)
90.734% <= 90.111 milliseconds (cumulative count 453671)
91.103% <= 91.135 milliseconds (cumulative count 455513)
91.485% <= 92.159 milliseconds (cumulative count 457427)
91.674% <= 93.119 milliseconds (cumulative count 458369)
91.923% <= 94.143 milliseconds (cumulative count 459617)
92.180% <= 95.103 milliseconds (cumulative count 460898)
92.212% <= 96.127 milliseconds (cumulative count 461060)
92.303% <= 97.151 milliseconds (cumulative count 461516)
92.454% <= 98.111 milliseconds (cumulative count 462272)
92.842% <= 99.135 milliseconds (cumulative count 464210)
93.132% <= 100.159 milliseconds (cumulative count 465662)
93.281% <= 101.119 milliseconds (cumulative count 466406)
93.395% <= 102.143 milliseconds (cumulative count 466973)
93.566% <= 103.103 milliseconds (cumulative count 467831)
93.808% <= 104.127 milliseconds (cumulative count 469040)
93.971% <= 105.151 milliseconds (cumulative count 469856)
94.207% <= 106.111 milliseconds (cumulative count 471035)
94.416% <= 107.135 milliseconds (cumulative count 472079)
94.673% <= 108.159 milliseconds (cumulative count 473366)
94.845% <= 109.119 milliseconds (cumulative count 474227)
95.129% <= 110.143 milliseconds (cumulative count 475646)
95.399% <= 111.103 milliseconds (cumulative count 476993)
95.649% <= 112.127 milliseconds (cumulative count 478244)
95.727% <= 113.151 milliseconds (cumulative count 478637)
95.930% <= 114.111 milliseconds (cumulative count 479651)
96.132% <= 115.135 milliseconds (cumulative count 480662)
96.277% <= 116.159 milliseconds (cumulative count 481385)
96.388% <= 117.119 milliseconds (cumulative count 481940)
96.472% <= 118.143 milliseconds (cumulative count 482360)
96.624% <= 119.103 milliseconds (cumulative count 483119)
96.711% <= 120.127 milliseconds (cumulative count 483554)
96.836% <= 121.151 milliseconds (cumulative count 484178)
96.995% <= 122.111 milliseconds (cumulative count 484973)
97.199% <= 123.135 milliseconds (cumulative count 485993)
97.326% <= 124.159 milliseconds (cumulative count 486629)
97.378% <= 125.119 milliseconds (cumulative count 486890)
97.484% <= 126.143 milliseconds (cumulative count 487418)
97.661% <= 127.103 milliseconds (cumulative count 488306)
97.716% <= 128.127 milliseconds (cumulative count 488579)
97.821% <= 129.151 milliseconds (cumulative count 489104)
97.961% <= 130.111 milliseconds (cumulative count 489806)
97.967% <= 131.199 milliseconds (cumulative count 489836)
97.986% <= 133.119 milliseconds (cumulative count 489932)
98.004% <= 134.143 milliseconds (cumulative count 490019)
98.057% <= 135.167 milliseconds (cumulative count 490286)
98.118% <= 136.191 milliseconds (cumulative count 490589)
98.187% <= 137.215 milliseconds (cumulative count 490937)
98.241% <= 138.111 milliseconds (cumulative count 491204)
98.280% <= 139.135 milliseconds (cumulative count 491399)
98.400% <= 140.159 milliseconds (cumulative count 492002)
98.541% <= 141.183 milliseconds (cumulative count 492704)
98.729% <= 142.207 milliseconds (cumulative count 493646)
98.815% <= 143.103 milliseconds (cumulative count 494075)
98.832% <= 144.127 milliseconds (cumulative count 494159)
98.862% <= 145.151 milliseconds (cumulative count 494309)
98.933% <= 146.175 milliseconds (cumulative count 494663)
98.985% <= 147.199 milliseconds (cumulative count 494924)
99.007% <= 148.223 milliseconds (cumulative count 495035)
99.096% <= 149.119 milliseconds (cumulative count 495479)
99.236% <= 150.143 milliseconds (cumulative count 496178)
99.238% <= 151.167 milliseconds (cumulative count 496190)
99.295% <= 152.191 milliseconds (cumulative count 496475)
99.373% <= 153.215 milliseconds (cumulative count 496865)
99.438% <= 155.135 milliseconds (cumulative count 497189)
99.504% <= 156.159 milliseconds (cumulative count 497519)
99.504% <= 157.183 milliseconds (cumulative count 497522)
99.614% <= 158.207 milliseconds (cumulative count 498068)
99.664% <= 159.103 milliseconds (cumulative count 498320)
99.698% <= 160.127 milliseconds (cumulative count 498491)
99.722% <= 161.151 milliseconds (cumulative count 498611)
99.765% <= 162.175 milliseconds (cumulative count 498824)
99.804% <= 163.199 milliseconds (cumulative count 499022)
99.866% <= 164.223 milliseconds (cumulative count 499331)
99.884% <= 165.119 milliseconds (cumulative count 499418)
99.904% <= 185.215 milliseconds (cumulative count 499520)
99.909% <= 186.111 milliseconds (cumulative count 499547)
99.935% <= 187.135 milliseconds (cumulative count 499673)
99.971% <= 188.159 milliseconds (cumulative count 499856)
99.999% <= 190.207 milliseconds (cumulative count 499994)
100.000% <= 191.103 milliseconds (cumulative count 500000)

Summary:
  throughput summary: 212585.45 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       54.084    10.088    49.151   109.759   147.583   190.463
====== GET ======
  500001 requests completed in 1.78 seconds
  5000 parallel clients
  200 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: yes
  threads: 2

Latency by percentile distribution:
0.000% <= 9.071 milliseconds (cumulative count 3)
50.000% <= 41.119 milliseconds (cumulative count 250737)
75.000% <= 48.735 milliseconds (cumulative count 375044)
87.500% <= 53.023 milliseconds (cumulative count 437687)
93.750% <= 56.831 milliseconds (cumulative count 468869)
96.875% <= 59.775 milliseconds (cumulative count 484484)
98.438% <= 62.527 milliseconds (cumulative count 492194)
99.219% <= 64.479 milliseconds (cumulative count 496097)
99.609% <= 66.303 milliseconds (cumulative count 498047)
99.805% <= 67.263 milliseconds (cumulative count 499037)
99.902% <= 69.951 milliseconds (cumulative count 499523)
99.951% <= 78.527 milliseconds (cumulative count 499757)
99.976% <= 78.975 milliseconds (cumulative count 499886)
99.988% <= 79.167 milliseconds (cumulative count 499958)
99.994% <= 79.231 milliseconds (cumulative count 499982)
99.997% <= 79.295 milliseconds (cumulative count 500000)
100.000% <= 79.295 milliseconds (cumulative count 500000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 9.103 milliseconds (cumulative count 12)
0.061% <= 10.103 milliseconds (cumulative count 303)
0.099% <= 11.103 milliseconds (cumulative count 495)
0.124% <= 12.103 milliseconds (cumulative count 618)
0.176% <= 13.103 milliseconds (cumulative count 879)
0.220% <= 15.103 milliseconds (cumulative count 1098)
0.342% <= 16.103 milliseconds (cumulative count 1710)
0.449% <= 17.103 milliseconds (cumulative count 2244)
0.502% <= 18.111 milliseconds (cumulative count 2511)
0.545% <= 22.111 milliseconds (cumulative count 2727)
0.587% <= 23.103 milliseconds (cumulative count 2934)
0.649% <= 24.111 milliseconds (cumulative count 3243)
0.718% <= 25.103 milliseconds (cumulative count 3591)
0.904% <= 26.111 milliseconds (cumulative count 4518)
1.121% <= 27.103 milliseconds (cumulative count 5607)
1.732% <= 28.111 milliseconds (cumulative count 8661)
3.030% <= 29.103 milliseconds (cumulative count 15150)
4.306% <= 30.111 milliseconds (cumulative count 21531)
6.265% <= 31.103 milliseconds (cumulative count 31323)
8.716% <= 32.111 milliseconds (cumulative count 43578)
11.993% <= 33.119 milliseconds (cumulative count 59964)
15.631% <= 34.111 milliseconds (cumulative count 78153)
19.772% <= 35.103 milliseconds (cumulative count 98859)
25.054% <= 36.127 milliseconds (cumulative count 125271)
30.308% <= 37.119 milliseconds (cumulative count 151539)
34.956% <= 38.111 milliseconds (cumulative count 174780)
39.854% <= 39.103 milliseconds (cumulative count 199269)
45.299% <= 40.127 milliseconds (cumulative count 226494)
50.147% <= 41.119 milliseconds (cumulative count 250737)
54.277% <= 42.111 milliseconds (cumulative count 271383)
57.254% <= 43.103 milliseconds (cumulative count 286271)
60.309% <= 44.127 milliseconds (cumulative count 301544)
63.369% <= 45.119 milliseconds (cumulative count 316844)
66.451% <= 46.111 milliseconds (cumulative count 332255)
69.602% <= 47.103 milliseconds (cumulative count 348011)
72.824% <= 48.127 milliseconds (cumulative count 364118)
76.382% <= 49.119 milliseconds (cumulative count 381911)
79.826% <= 50.111 milliseconds (cumulative count 399128)
82.669% <= 51.103 milliseconds (cumulative count 413345)
85.397% <= 52.127 milliseconds (cumulative count 426986)
87.719% <= 53.119 milliseconds (cumulative count 438593)
89.485% <= 54.111 milliseconds (cumulative count 447425)
91.219% <= 55.103 milliseconds (cumulative count 456095)
92.746% <= 56.127 milliseconds (cumulative count 463730)
94.115% <= 57.119 milliseconds (cumulative count 470576)
95.305% <= 58.111 milliseconds (cumulative count 476525)
96.336% <= 59.103 milliseconds (cumulative count 481679)
97.156% <= 60.127 milliseconds (cumulative count 485780)
97.708% <= 61.119 milliseconds (cumulative count 488540)
98.224% <= 62.111 milliseconds (cumulative count 491120)
98.709% <= 63.103 milliseconds (cumulative count 493547)
99.062% <= 64.127 milliseconds (cumulative count 495308)
99.428% <= 65.119 milliseconds (cumulative count 497138)
99.569% <= 66.111 milliseconds (cumulative count 497843)
99.792% <= 67.135 milliseconds (cumulative count 498962)
99.837% <= 68.159 milliseconds (cumulative count 499187)
99.851% <= 69.119 milliseconds (cumulative count 499253)
99.914% <= 70.143 milliseconds (cumulative count 499571)
99.932% <= 78.143 milliseconds (cumulative count 499658)
99.987% <= 79.103 milliseconds (cumulative count 499934)
100.000% <= 80.127 milliseconds (cumulative count 500000)

Summary:
  throughput summary: 281373.66 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       42.526     9.064    41.119    57.887    63.967    79.295